<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Authenticate Response</string>
	<key>pfm_title</key>
	<string>Authenticate</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfm_domain</key>
	<string>Authenticate</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>MessageType</string>
			<key>pfm_title</key>
			<string>Message Type</string>
			<key>pfm_description</key>
			<string>Message Type</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_default</key>
			<string>Authenticate</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>UDID</string>
			<key>pfm_title</key>
			<string>UDID</string>
			<key>pfm_description</key>
			<string>Universal Device Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>SerialNumber</string>
			<key>pfm_title</key>
			<string>Serial Number</string>
			<key>pfm_description</key>
			<string>Device Serial Number</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>OSVersion</string>
			<key>pfm_title</key>
			<string>OS Version</string>
			<key>pfm_description</key>
			<string>Operating System Version</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>BuildVersion</string>
			<key>pfm_title</key>
			<string>Build Version</string>
			<key>pfm_description</key>
			<string>Operating System Build Version</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_require</key>
			<string>always</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProductName</string>
			<key>pfm_title</key>
			<string>Product Name</string>
			<key>pfm_description</key>
			<string>Name of the product eg iPad4,1</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Topic</string>
			<key>pfm_title</key>
			<string>Push Topic</string>
			<key>pfm_description</key>
			<string>APNS Push Topic for this MDM. The Push Topic is the User ID field of the APNS Certificate.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Challenge</string>
			<key>pfm_title</key>
			<string>Challenge</string>
			<key>pfm_description</key>
			<string>The challenge sent to the device in an earlier OTA phase</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>Model</string>
			<key>pfm_title</key>
			<string>Model</string>
			<key>pfm_description</key>
			<string>The device model (macOS only) eg. iMac15,1</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ModelName</string>
			<key>pfm_title</key>
			<string>Model Short Name</string>
			<key>pfm_description</key>
			<string>The short name of the model eg. iMac</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>DeviceName</string>
			<key>pfm_title</key>
			<string>Device Name</string>
			<key>pfm_description</key>
			<string>The name set on the device. eg. on macOS Sharing preferences.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
</dict>
</plist>
